<?php

$people_style_info = [
    1 => "有极强的原则性、不易妥协、常说“应该”及“不应该”、黑白分明、对自己和别人要求甚高、追求完美、不断改进、感情世界薄弱；希望把每件事都做得尽善尽美，希望自己或是这个世界都更进步。时时刻刻反省自己是否犯错，也会纠正别人的错误。",
    2 => "渴望别人的爱或良好关系、甘愿迁就他人、以人为本、要别人觉得需要自己、常忽略自己 ；很在意别人的感情和需要，十分热心，愿意付出爱给别人，看到别人满足地接受他们的爱，才会觉得自己活得有价值。",
    3 => "强烈好胜心，喜欢权威，常与别人比较，以成就衡量自己的价值高低，着重形象，工作狂，惧怕表达内心感受 ；希望能够得到大家的肯定。是个野心家，不断地追求有效，希望与众不同，受到别人的注目、羡慕，成为众人的焦点。",
    4 => "情绪化，追求浪漫，惧怕被人拒绝，觉得别人不明白自己， 占有欲强，我行我素生活风格：爱讲不开心的事，易忧郁、妒忌，生活追寻感觉好；很珍惜自己的爱和情感，所以想好好地滋养它们，并用最美、最特殊的方式来表达。他们想创造出独一无二、与众不同的形象和作品，所以不停地自我察觉、自我反省，以及自我探索。",
    5 => "冷眼看世界，孤僻，喜欢远离人群，抽离情感，喜欢思考分析，要知很多，但缺乏行动，对物质生活要求不高，喜欢精神生活，不善表达内心感受；想努力获取更多的知识，来了解环境，面对周遭的事物。他们想找出事情的脉络与原理，作为行动的准则。有了知识，他们才敢行动，也才会有安全感。",
    6 => "做事小心谨慎，不轻易相信别人，多疑虑，喜欢群体生活，为别人做事尽心尽力，不喜欢受人注视，安于现状，不喜转换新环境；相信权威、跟随权威的引导行事，然而另一方面又容易反权威，性格充满矛盾。他们的团体意识很强，需要亲密感，需要被喜爱、被接纳并得到安全的保障。",
    7 => "乐观，要新鲜感，追上潮流，不喜承受压力，怕负面情绪；想过愉快的生活，想创新、自娱娱人，渴望过比较享受的生活，把人间的不美好化为乌有。他们喜欢投入经验快乐及情绪高昂的世界，所以他们总是不断地寻找快乐、经验快乐。",
    8 => "追求权力，讲求实力，不靠他人，有正义感。要话事（说的算），喜欢做大事；是绝对的行动派，一碰到问题便马上采取行动去解决。想要独立自主，一切靠自己，依照自己的能力做事，要建设前不惜先破坏，想带领大家走向公平、正义。",
    9 => "须花长时间作决定，难于拒绝他人，不懂宣泄愤怒；显得十分温和，不喜欢与人起冲突，不自夸、不爱出风头，个性淡薄。想要和人和谐相处，避开所有的冲突与紧张，希望事物能维持美好的现状。忽视会让自己不愉快的事物，并尽可能让自己保持平稳、平静。",
];
